package com.javarush.games.ticktacktoe.view.shapes;

/**
 * Класс, содержащий готовые массивы изображений (по терминологии JavaRush - формы)
 * Каждый элемент массива это код цвета из движка JavaRush Games.
 * Легко создать такой массив можно <a href="https://javarush.com/projects/apps/134119">здесь</a>
 *
 * @author LuneFox
 */
public class Shape {

    /** Клетка поля */
    public static final int[][] FIELD_CELL_SHAPE = new int[][]{
            {126, 131, 126, 131, 126, 131, 126, 131, 126, 131, 126},
            {131, 140, 128, 140, 128, 140, 128, 140, 128, 140, 131},
            {126, 128, 140, 128, 140, 128, 140, 128, 140, 128, 126},
            {131, 140, 128, 140, 128, 140, 128, 140, 128, 140, 131},
            {126, 128, 140, 128, 140, 128, 140, 128, 140, 128, 126},
            {131, 140, 128, 140, 128, 140, 128, 140, 128, 140, 131},
            {126, 128, 140, 128, 140, 128, 140, 128, 140, 128, 126},
            {131, 140, 128, 140, 128, 140, 128, 140, 128, 140, 131},
            {126, 128, 140, 128, 140, 128, 140, 128, 140, 128, 126},
            {131, 140, 128, 140, 128, 140, 128, 140, 128, 140, 131},
            {126, 131, 126, 131, 126, 131, 126, 131, 126, 131, 126}};
    /** Диск чёрной стороной вверх */
    public static final int[][] BLACK_DISK = new int[][]{
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 1, 1, 1, 0, 0, 0},
            {0, 0, 1, 1, 1, 1, 1, 0, 0},
            {0, 1, 1, 1, 1, 1, 1, 1, 0},
            {0, 1, 1, 1, 1, 1, 1, 1, 0},
            {0, 2, 1, 1, 1, 1, 1, 2, 0},
            {0, 0, 2, 1, 1, 1, 2, 0, 0},
            {0, 0, 0, 2, 2, 2, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}};
    /** Переворот чёрного диска, кадр 1 */
    public static final int[][] BLACK_DISK_FLIP_1 = new int[][]{
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 1, 1, 1, 1, 1, 0, 0},
            {0, 1, 1, 1, 1, 1, 1, 1, 0},
            {0, 1, 1, 1, 1, 1, 1, 1, 0},
            {0, 2, 1, 1, 1, 1, 1, 2, 0},
            {0, 0, 2, 2, 2, 2, 2, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}};
    /** Переворот чёрного диска, кадр 2 */
    public static final int[][] BLACK_DISK_FLIP_2 = new int[][]{
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 1, 1, 1, 1, 1, 0, 0},
            {0, 2, 1, 1, 1, 1, 1, 2, 0},
            {0, 0, 2, 2, 2, 2, 2, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}};
    /** Переворот чёрного диска, кадр 3 */
    public static final int[][] BLACK_DISK_FLIP_3 = new int[][]{
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 2, 2, 2, 2, 2, 0, 0},
            {0, 1, 2, 2, 2, 2, 2, 1, 0},
            {0, 0, 1, 1, 1, 1, 1, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}};
    /** Переворот чёрного диска, кадр 4 */
    public static final int[][] BLACK_DISK_FLIP_4 = new int[][]{
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 2, 2, 2, 2, 2, 0, 0},
            {0, 2, 2, 2, 2, 2, 2, 2, 0},
            {0, 1, 2, 2, 2, 2, 2, 1, 0},
            {0, 1, 2, 2, 2, 2, 2, 1, 0},
            {0, 0, 1, 1, 1, 1, 1, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}};
    /** Диск белой стороной вверх */
    public static final int[][] WHITE_DISK = new int[][]{
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 2, 2, 2, 0, 0, 0},
            {0, 0, 2, 2, 2, 2, 2, 0, 0},
            {0, 2, 2, 2, 2, 2, 2, 2, 0},
            {0, 2, 2, 2, 2, 2, 2, 2, 0},
            {0, 1, 2, 2, 2, 2, 2, 1, 0},
            {0, 0, 1, 2, 2, 2, 1, 0, 0},
            {0, 0, 0, 1, 1, 1, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}};
    /** Маркер доступного хода для чёрных */
    public static final int[][] LEGAL_MOVE_MARK_BLACK = new int[][]{{1}};
    /** Маркер доступного хода для белых */
    public static final int[][] LEGAL_MOVE_MARK_WHITE = new int[][]{{2}};
    /** Маркер последнего совершённого хода */
    public static final int[][] LAST_MOVE_MARK = new int[][]{{5}};
}
